	Баг Репорт(Bug Report)
	//это документ, описывающий ситуацию или 
	//последовательность действий приведшую к некорректной работе объекта
	//тестирования, с указанием причин и ожидаемого результата.

	Серьезность(Severity)
	  /*• S1 Блокирующий(Blocker)
		• S2 Критический(Critical)
		• S3 Значительный(Major)
		• S4 Незначительный(Minor)
		• S5 Тривиальный(Trivial)*/
	Приоритет(Priority) Приоритет дефекта :
	  /*• P1 Высокий(High)
		• P2 Средний(Medium)
		• P3 Низкий(Low)*/

	Уровни Тестирования

		/*1. Модульное тестирование(Unit Testing)
		Компонентное тестирование проверяет функциональность и ищет дефекты в частях приложения, которые доступны и могут быть протестированы по - отдельности

		2. Интеграционное тестирование(Integration Testing)
		Проверяется взаимодействие между компонентами системы после проведения компонентного тестирования.

		3. Системное тестирование(System Testing)
		Основной задачей системного тестирования является проверка как функциональных, так и не функциональных требований в системе в целом.

		4. Операционное тестирование(Release Testing).
		Даже если система удовлетворяет всем требованиям, важно убедиться в том, что она удовлетворяет нуждам пользователя и выполняет свою роль в среде своей эксплуатации

		5. Приемочное тестирование(Acceptance Testing)
		Формальный процесс тестирования, который проверяет соответствие системы требованиям и проводится с целью */

	
	Тестирование программного обеспечения — 
	//проверка соответствия между реальным и ожидаемым поведением программы,
	//осуществляемая на конечном наборе тестов, выбранном определенным образом

	Качество программного обеспечения(Software Quality) —
		/*это совокупность характеристик программного обеспечения,
	относящихся к его способности удовлетворять установленные и предполагаемые потребности*/

	Верификация(verification) — 
	/*это процесс оценки системы или её компонентов с целью
	определения удовлетворяют ли результаты текущего этапа разработки условиям, сформированным
	в начале этого этапа*/

	Валидация(validation) —/* это определение соответствия разрабатываемого ПО
	ожиданиям и потребностям пользователя, требованиям к системе
	*/

	Техники тест дизайна
	//Эквивалентное Разделение
	//Анализ Граничных Значений
	//Предугадывание ошибки
	//Исчерпывающее тестирование